EmcraftSystems/linux-upstream/include/dt-bindings/clock/lpc17xx-clock.h
/*
 * Copyright (C) 2017 Emcraft Systems
 * Sergei Miroshnichenko <sergeimir@emcraft.com>
 *
 * License terms:  GNU General Public License (GPL), version 2
 */
#ifndef _DT_BINDINGS_CLOCK_LPC17XX_H
#define _DT_BINDINGS_CLOCK_LPC17XX_H

#define LPC17XX_REGULAR_CLOCKS	32

#define CLOCK_LCD		0
#define CLOCK_TIM0		1
#define CLOCK_TIM1		2
#define CLOCK_UART0		3
#define CLOCK_UART1		4
#define CLOCK_PWM0		5
#define CLOCK_PWM1		6
#define CLOCK_I2C0		7
#define CLOCK_UART4		8
#define CLOCK_RTC		9
#define CLOCK_SSP1		10
#define CLOCK_EMC		11
#define CLOCK_ADC		12
#define CLOCK_CAN1		13
#define CLOCK_CAN2		14
#define CLOCK_GPIO		15
#define CLOCK_SPIFI		16
#define CLOCK_MCPWM		17
#define CLOCK_QEI		18
#define CLOCK_I2C1		19
#define CLOCK_SSP2		20
#define CLOCK_SSP0		21
#define CLOCK_TIM2		22
#define CLOCK_TIM3		23
#define CLOCK_UART2		24
#define CLOCK_UART3		25
#define CLOCK_I2C2		26
#define CLOCK_I2S		27
#define CLOCK_SDC		28
#define CLOCK_GPDMA		29
#define CLOCK_ENET		30
#define CLOCK_USB		31
#define CLOCK_SYS		32
#define CLOCK_PLL0		33
#define CLOCK_PLL1		34
#define CLOCK_CCLKSEL		35
#define CLOCK_CCLK		36
#define CLOCK_PCLK		37
#define CLOCK_USBSEL		38
#define CLOCK_SPIFISEL		39
#define CLOCK_END		40

#endif /* _DT_BINDINGS_CLOCK_LPC17XX_H */
